Public Member Functions | Friends | List of all members
ACAPI::Keynote::v1::KeynoteItem Class Reference
Keynote
A class that represents an item in the keynote tree structure. More...
#include <KeynoteItem.hpp>
 Inheritance diagram for ACAPI::Keynote::v1::KeynoteItem:
 Public Member Functions
API_Guid  | GetId () const
ItemKey  | GetKey () const
Result< void >  | SetKey (const ItemKey &newKey)
Modifies the Key of the item.
Title  | GetTitle () const
Result< void >  | SetTitle (const Title &newTitle)
Modifies the Title of the item.
Description  | GetDescription () const
Result< void >  | SetDescription (const Description &newDescription)
Modifies the Description of the item.
Reference  | GetReference () const
Result< void >  | SetReference (const Reference &newReference)
Modifies the Reference of the item.
GS::UniString  | GetUIText () const
 Public Member Functions inherited from ACAPI::v1::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
 class  | Impl::KeynoteFolderImpl
 class  | KeynoteFolder
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::v1::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::v1::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
A class that represents an item in the keynote tree structure.
Since
Archicad 28
Member Function Documentation
◆ GetDescription()
 Description ACAPI::Keynote::v1::KeynoteItem::GetDescription  |  ( |   | ) |   const
Returns
The description of the item
◆ GetId()
 API_Guid ACAPI::Keynote::v1::KeynoteItem::GetId  |  ( |   | ) |   const
Returns
The database Id of the item
◆ GetKey()
 ItemKey ACAPI::Keynote::v1::KeynoteItem::GetKey  |  ( |   | ) |   const
Returns
The key of the item
◆ GetReference()
 Reference ACAPI::Keynote::v1::KeynoteItem::GetReference  |  ( |   | ) |   const
Returns
The reference of the item
◆ GetTitle()
 Title ACAPI::Keynote::v1::KeynoteItem::GetTitle  |  ( |   | ) |   const
Returns
The title of the item
◆ GetUIText()
 GS::UniString ACAPI::Keynote::v1::KeynoteItem::GetUIText  |  ( |   | ) |   const
Returns
The text representation of the item, used on UI elements
◆ SetDescription()
 Result< void > ACAPI::Keynote::v1::KeynoteItem::SetDescription  |  ( |  const Description &  |  newDescription | )
Modifies the Description of the item.
Parameters
newDescription | The Description to be set
Returns
The result of the modification
 ACAPI::Keynote::KeynoteItem firstItem = items.Unwrap ()[0];
 ACAPI_CallUndoableCommand ("Modify first keynote item", [&firstItem]() -> GSErrCode {
 if (firstItem.SetKey ("K-API").IsErr ()) {
 return Error;
 }
 if (firstItem.SetTitle ("Title set for Item by API").IsErr ()) {
 return Error;
 }
 if (firstItem.SetDescription ("Keynote item modified by the test addon").IsErr ()){
 return Error;
 }
 if (firstItem.SetReference ("Keynote item modified by the test addon").IsErr ()) {
 return Error;
 }
 return NoError;
 });
◆ SetKey()
 Result< void > ACAPI::Keynote::v1::KeynoteItem::SetKey  |  ( |  const ItemKey &  |  newKey | )
Modifies the Key of the item.
Parameters
newKey | The key to be set
Returns
The result of the modification
 ACAPI::Keynote::KeynoteItem firstItem = items.Unwrap ()[0];
 ACAPI_CallUndoableCommand ("Modify first keynote item", [&firstItem]() -> GSErrCode {
 if (firstItem.SetKey ("K-API").IsErr ()) {
 return Error;
 }
 if (firstItem.SetTitle ("Title set for Item by API").IsErr ()) {
 return Error;
 }
 if (firstItem.SetDescription ("Keynote item modified by the test addon").IsErr ()){
 return Error;
 }
 if (firstItem.SetReference ("Keynote item modified by the test addon").IsErr ()) {
 return Error;
 }
 return NoError;
 });
◆ SetReference()
 Result< void > ACAPI::Keynote::v1::KeynoteItem::SetReference  |  ( |  const Reference &  |  newReference | )
Modifies the Reference of the item.
Parameters
newReference | The Reference to be set
Returns
The result of the modification
 ACAPI::Keynote::KeynoteItem firstItem = items.Unwrap ()[0];
 ACAPI_CallUndoableCommand ("Modify first keynote item", [&firstItem]() -> GSErrCode {
 if (firstItem.SetKey ("K-API").IsErr ()) {
 return Error;
 }
 if (firstItem.SetTitle ("Title set for Item by API").IsErr ()) {
 return Error;
 }
 if (firstItem.SetDescription ("Keynote item modified by the test addon").IsErr ()){
 return Error;
 }
 if (firstItem.SetReference ("Keynote item modified by the test addon").IsErr ()) {
 return Error;
 }
 return NoError;
 });
◆ SetTitle()
 Result< void > ACAPI::Keynote::v1::KeynoteItem::SetTitle  |  ( |  const Title &  |  newTitle | )
Modifies the Title of the item.
Parameters
newTitle | The Title to be set
Returns
The result of the modification
 ACAPI::Keynote::KeynoteItem firstItem = items.Unwrap ()[0];
 ACAPI_CallUndoableCommand ("Modify first keynote item", [&firstItem]() -> GSErrCode {
 if (firstItem.SetKey ("K-API").IsErr ()) {
 return Error;
 }
 if (firstItem.SetTitle ("Title set for Item by API").IsErr ()) {
 return Error;
 }
 if (firstItem.SetDescription ("Keynote item modified by the test addon").IsErr ()){
 return Error;
 }
 if (firstItem.SetReference ("Keynote item modified by the test addon").IsErr ()) {
 return Error;
 }
 return NoError;
 });